---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotUseCornerMullion
source: html/489b61fb-2664-a298-8078-605a196d9e34.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.CannotUseCornerMullion Property

Corner Mullions must be placed at a location that can have neighboring Panels that are not tangent. With the exception of Wall Join locations, Corner Mullions are not currently supported on the external boundaries of Curtain elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUseCornerMullion { get; }
```